'use strict';

const age = prompt('Вкажіть Ваш рік народження!');
const citi = prompt('В якому місті Ви живете! Виберіть:' +
  '(Київ, Вашингтон чи Лондон)');
const sport = prompt('Вкажіть Ваш улюблений вид спорту! ' +
  'Виберіть: (теніс, бокс, баскетбол)');

if (age === null) {
  alert(`Шкода, що Ви не захотіли ввести Ваш вік!`)
} else if (citi === null) {
  alert(`Шкода, що Ви не захотіли ввести Ваше місто!`)
} else if (sport === null) {
  alert(`Шкода, що Ви не захотіли ввести вид спорту!`)
}  else if(citi === 'Київ') {
  if (sport === 'теніс') {
    alert(`  Ваш вік = ${age},
    Ти живеш у столиці України!,
    Круто! Хочеш стати Джиммі Коннорсу?`)
  } else if (sport === 'бокс') {
    alert(`  Ваш вік = ${age},
    Ти живеш у столиці України!,
    Круто! Хочеш стати Олександром Усиком ?`)
  } else if (sport === 'баскетбол') {
    alert(`  Ваш вік = ${age},
    Ти живеш у столиці України!,
    Круто! Хочеш стати Майклом Джорданом ?`)
  }
} else if (citi === 'Вашингтон')  {
  if (sport === 'теніс') {
    alert(`  Ваш вік = ${age},
    Ти живеш у столиці США!,
    Круто! Хочеш стати Джиммі Коннорсу?`)
  } else if (sport === 'бокс') {
    alert(`  Ваш вік = ${age},
    Ти живеш у столиці США!,
    Круто! Хочеш стати Олександром Усиком ?`)
  } else if (sport === 'баскетбол') {
    alert(`  Ваш вік = ${age},
    Ти живеш у столиці США!,
    Круто! Хочеш стати Майклом Джорданом ?`)
  }
} else if (citi === 'Лондон')  {
  if (sport === 'теніс') {
    alert(`  Ваш вік = ${age},
    Ти живеш у столиці Англії!,
    Круто! Хочеш стати Джиммі Коннорсу?`)
  } else if (sport === 'бокс') {
    alert(`  Ваш вік = ${age},
    Ти живеш у столиці Англії!,
    Круто! Хочеш стати Олександром Усиком ?`)
  } else if (sport === 'баскетбол') {
    alert(`  Ваш вік = ${age},
    Ти живеш у столиці Англії!,
    Круто! Хочеш стати Майклом Джорданом ?`)
  }
} else if (citi) {
  if (sport === 'теніс') {
    alert(`  Ваш вік = ${age},
    Ти живеш у місті ${citi}!,
    Круто! Хочеш стати Джиммі Коннорсу?`)
  } else if (sport === 'бокс') {
    alert(`  Ваш вік = ${age},
    Ти живеш у місті ${citi}!,
    Круто! Хочеш стати Олександром Усиком ?`)
  } else if (sport === 'баскетбол') {
    alert(`  Ваш вік = ${age},
    Ти живеш у місті ${citi}!,
    Круто! Хочеш стати Майклом Джорданом ?`)
  }
}

